LETTERS_ALL = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'  # Все буквы
MAIN_LETTERS = 'абвгдезиклмнопрстуя'  # Основные буквы встречающиеся в именах
LWSC = 'абвгдеёжзиклмнопрстуфхцчшщыэюя'  # Letters without SPECIAL_CHARS and 'й'
FLITN = 'абвгдеёжзиклмнопрстуфхцчшщэюя'  # First Letter In The Name.
LLITN = 'бвгджзйклмнпрстфхцчшэя'  # Last Letter In The Name
VOWELS = 'аеёиоуыэюя'  # Согласные
CONSONANTS = 'бвгджзклмнпрстч'  # Гласные без 'й ф х ц ш щ'
SPECIAL_CHARS = 'ъь'  # Знаки

# пслоги в мужских именах
# NAME_SYLLABLE = ('ус', 'ар', 'ен', 'ри', 'ан', 'як', '', '', '', '')

# окончания мужских имен
NAME_ENDING_MALE = ('ей', 'ем', 'ём', 'ил', 'ис', 'ан', 'тя', 'ся', 'ма', 'ня', 'ша', 'ор', 'ра', 'им', 'ат')

# окончание мужских фамилий
SURNAME_ENDING_MALE = ('ов', 'ев', 'ёв', 'ый', 'ин', 'ых', 'ий', 'ер', 'иг', 'анн', 'арц', 'узе', 'идт', 'дзе')

MIN_NAME_LENGTH = 3
MAX_NAME_LENGTH = 5

MIN_SURNAME_LENGTH = 3
MAX_SURNAME_LENGTH = 6